uliano/brio/brio/stm32f4/device_tables.hpp
constexpr uint32_t dac_base() {
#if defined(DAC_BASE)
    return DAC_BASE;
#else
    return 0;
#endif
}

/// The DAC's enable and reset bits in RCC_APB1ENR / RCC_APB1RSTR
/// (7.3.13, 7.3.6); 0 on a part with no DAC.
constexpr uint32_t dac_clock_mask() {
#if defined(RCC_APB1ENR_DACEN)
    return RCC_APB1ENR_DACEN;
#else
    return 0;
#endif
}

constexpr uint32_t dac_reset_mask() {
#if defined(RCC_APB1RSTR_DACRST)
    return RCC_APB1RSTR_DACRST;
#else
    return 0;
#endif
}

/// The DAC's underrun interrupt line - TIM6's vector, which the pack
/// spells TIM6_DAC_IRQn on exactly the parts that have a DAC and TIM6_IRQn
/// on the rest. A handler bound here answers for both peripherals.
constexpr IRQn_Type dac_irq() {
#if defined(DAC_BASE)
    return TIM6_DAC_IRQn;
#else
    return NonMaskableInt_IRQn;   // unreachable: callers check dac_present first
#endif
}


/**
 * WHERE A CONVERTER'S DMA REQUEST SITS IN THE FABRIC - the ANALOG slice
 * of the request mapping tables, in the shape and for the reason the
 * serial slice above states: no device header carries a request mapping
 * and the tables are the reference manual's, keyed per part class.
 *
 * RM0090 table 44, RM0390 table 29 and RM0383 table 28 agree on every
 * converter they share: ADC1 is DMA2's stream 0 and stream 4 on channel
 * 0, ADC2 is stream 2 and stream 3 on channel 1, ADC3 is stream 0 and
 * stream 1 on channel 2 - so ADC1 and ADC3 CONTEND for stream 0 with two
 * different channels, which is what makes a placement a cell and not a
 * number. Every ADC request is DMA2's; none of them is DMA1's.
 */
constexpr DmaPlacements adc_dma_placements(uint8_t instance) {
    DmaPlacements p{};
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || \
    defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F437xx) || \
    defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
    defined(STM32F411xE)
    p.known = true;
    if (!adc_present(instance)) {
        return p;   // the class's table is read, this part has no such converter
    }
    switch (instance) {
        case 1: p.count = 2; p.at[0] = {2, 0, 0}; p.at[1] = {2, 4, 0}; break;
        case 2: p.count = 2; p.at[0] = {2, 2, 1}; p.at[1] = {2, 3, 1}; break;
        case 3: p.count = 2; p.at[0] = {2, 0, 2}; p.at[1] = {2, 1, 2}; break;
        default: break;
    }
#else
    (void)instance;
#endif
    return p;
}

/**
 * The DAC's two channels (RM0090 table 43, RM0390 table 28): DAC1 on
 * DMA1's stream 5 and DAC2 on stream 6, channel 7 both, one cell each.
 * The channel index here is this stratum's 0-based one, as everywhere
 * else in stm32f4/dac.hpp.
 */
constexpr DmaPlacements dac_dma_placements(uint8_t channel) {
    DmaPlacements p{};
#if defined(DAC_BASE)
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || \
    defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F437xx) || \
    defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F446xx)
    p.known = true;
    if (channel >= dac_channel_facts().channels) {
        return p;
    }
    p.count = 1;
    p.at[0] = channel == 0u ? DmaPlacement{1, 5, 7} : DmaPlacement{1, 6, 7};
#else
    (void)channel;
#endif
#else
    (void)channel;
#endif
    return p;
}

/// Whether (controller, stream, channel) is a cell converter `instance`'s
/// request is wired to. False on a part whose table was not read - a
/// refusal and never a guess, as with the serial instances.
constexpr bool adc_dma_placement_valid(uint8_t instance, uint8_t controller, uint8_t stream,
                                       uint8_t channel) {
    const DmaPlacements p = adc_dma_placements(instance);
    if (!p.known) {
        return false;
    }
    for (uint8_t i = 0; i < p.count; ++i) {
        if (p.at[i].controller == controller && p.at[i].stream == stream &&
            p.at[i].channel == channel) {
            return true;
        }
    }
    return false;
}

constexpr bool dac_dma_placement_valid(uint8_t dac_channel, uint8_t controller, uint8_t stream,
                                       uint8_t channel) {
    const DmaPlacements p = dac_dma_placements(dac_channel);
    if (!p.known) {
        return false;
    }
    for (uint8_t i = 0; i < p.count; ++i) {
        if (p.at[i].controller == controller && p.at[i].stream == stream &&
            p.at[i].channel == channel) {
            return true;
        }
    }
    return false;
}

} // namespace brio
